#include <iostream>
using namespace std;

int main() { 
    // setlocale(LC_ALL, "Ukrainian"); 
    cout << "--- Результати обчислень виразів ---" << endl;

    // 1. Додавання
    cout << "2 + 31 = " << 2 + 31 << endl;
    // 2. Множення та віднімання
    cout << "45 * 54 - 11 = " << 45 * 54 - 11 << endl;
    // 3. Цілочисельне ділення 
    cout << "15 / 4 = " << 15 / 4 << endl;
    // 4. Ділення з плаваючою крапкою
    cout << "15.0 / 4 = " << 15.0 / 4 << endl;
    // 5. Остача від ділення
    cout << "67 % 5 = " << 67 % 5 << endl;
    // 6. Складніший вираз з пріоритетами
    cout << "(2 * 45.1 + 3.2) / 2 = " << (2 * 45.1 + 3.2) / 2 << endl;

    return 0;
}
